app/views/home/index.html.erb

SELECT `locations`.* FROM `locations` ORDER BY name
---
       <tr><td>Location</td></tr>
       <tr><td><%= f.text_field :city, data: {autocomplete_source: Location.order(:name).map(&:name)},:class=>"tabbox",:name => "location" %></td></tr>

SELECT `cities`.* FROM `cities`
SELECT `specalities_masters`.* FROM `specalities_masters`
---
       <tr><td >City</td></tr>
       <tr><td style="padding-bottom: 14px;"><%= select_tag :city_id, options_from_collection_for_select(City.all, "id", "name"),:prompt => "Select City", :class=>"tabbox" %></td></tr>
      <tr> <td>Speciality</td></tr>
       <tr><td><%= select_tag :speciality_id,options_from_collection_for_select(SpecalitiesMaster.all, "id", "name"),:prompt => "Select Speciality", :class=>"tabbox" %></td></tr>